In [137]:
import pandas as pd

data = {
'Shop_Name': ['Starbucks', 'Blue Bottle', 'Dunkin', 'Peets', 'Starbucks', 'La Colombe', 'Blue Bottle', 'Peets', 'Starbucks', 'Dunkin'],
'Location': ['Hollywood', 'San Diego', 'San Diego', 'Hollywood', 'New York', 'New York', 'Hollywood', 'San Diego', 'New York', 'Hollywood'],
'Rating': [4.5, 4.7, 4.1, 4.3, 4.5, 4.8, 4.6, 4.2, 4.4, 3.9],
'Type': ['Chain', 'Independent', 'Chain', 'Chain', 'Chain', 'Independent', 'Independent', 'Chain', 'Chain', 'Chain']
}

df = pd.DataFrame(data)

In [138]:
df

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
2       Dunkin  San Diego     4.1        Chain
3        Peets  Hollywood     4.3        Chain
4    Starbucks   New York     4.5        Chain
5   La Colombe   New York     4.8  Independent
6  Blue Bottle  Hollywood     4.6  Independent
7        Peets  San Diego     4.2        Chain
8    Starbucks   New York     4.4        Chain
9       Dunkin  Hollywood     3.9        Chain

In [139]:
# How would you group the data by the Location column and retrieve the first entry for each group?
# Group the data by the Type column. How many entries are there for each type of coffee shop?
# By grouping data by the Shop_Name column, can you find the average rating for each shop?
# Group the data by both Location and Type. How many 'Chain' coffee shops are there in 'Hollywood'?
# If you group the data by Location, which location has the highest average rating?
# ============================================
# Group the data by Shop_Name. Which shop appears most frequently in the dataset?
# After grouping the data by the Type column, what's the maximum rating a 'Chain' coffee shop has received?
# If you group the data by the Location column, can you determine the range (difference between max and min) of ratings for shops in 'San Diego'?
# Group the dataset by Shop_Name. Which shop has the lowest average rating?
# By grouping the data based on Location, can you find the sum of ratings for each location?

In [140]:
# How would you group the data by the Location column and retrieve the first entry for each group?
first_entry_by_location = df.groupby('Location').first().reset_index()
first_entry_by_location

    Location    Shop_Name  Rating         Type
0  Hollywood    Starbucks     4.5        Chain
1   New York    Starbucks     4.5        Chain
2  San Diego  Blue Bottle     4.7  Independent

In [141]:
df.groupby('Location')

In [142]:
df.groupby('Location').first()

             Shop_Name  Rating         Type
Location
Hollywood    Starbucks     4.5        Chain
New York     Starbucks     4.5        Chain
San Diego  Blue Bottle     4.7  Independent

In [143]:
df.groupby('Location').first().index

Index(['Hollywood', 'New York', 'San Diego'], dtype='object', name='Location')

In [144]:
df.groupby('Location').first().reset_index()

    Location    Shop_Name  Rating         Type
0  Hollywood    Starbucks     4.5        Chain
1   New York    Starbucks     4.5        Chain
2  San Diego  Blue Bottle     4.7  Independent

In [145]:
df.groupby('Location').first().reset_index().index

RangeIndex(start=0, stop=3, step=1)

In [146]:
# Group the data by the Type column. How many entries are there for each type of coffee shop?
df

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
2       Dunkin  San Diego     4.1        Chain
3        Peets  Hollywood     4.3        Chain
4    Starbucks   New York     4.5        Chain
5   La Colombe   New York     4.8  Independent
6  Blue Bottle  Hollywood     4.6  Independent
7        Peets  San Diego     4.2        Chain
8    Starbucks   New York     4.4        Chain
9       Dunkin  Hollywood     3.9        Chain

In [147]:
df.groupby('Type').size()

Type
Chain          7
Independent    3
dtype: int64

In [148]:
df.groupby('Type').count().sum(axis = 0)[0]

10

In [149]:
df.head()

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
2       Dunkin  San Diego     4.1        Chain
3        Peets  Hollywood     4.3        Chain
4    Starbucks   New York     4.5        Chain

In [150]:
# By grouping data by the Shop_Name column, 
# can you find the average rating for each shop?

df.groupby('Shop_Name').mean('Rating').reset_index()

     Shop_Name    Rating
0  Blue Bottle  4.650000
1       Dunkin  4.000000
2   La Colombe  4.800000
3        Peets  4.250000
4    Starbucks  4.466667

In [151]:
# Group the data by both Location and Type. 
# How many 'Chain' coffee shops are there in 'Hollywood'?
temp_df = df.groupby(['Location', 'Type']).count().reset_index()
chain_in_hollywood = temp_df[(temp_df["Location"] == 'Hollywood') & (temp_df["Type"] == 'Chain')]

# Now, you can access the count of 'Chain' coffee shops in 'Hollywood'
chain_in_hollywood['Shop_Name']

0    3
Name: Shop_Name, dtype: int64

In [152]:
temp_df

    Location         Type  Shop_Name  Rating
0  Hollywood        Chain          3       3
1  Hollywood  Independent          1       1
2   New York        Chain          2       2
3   New York  Independent          1       1
4  San Diego        Chain          2       2
5  San Diego  Independent          1       1

In [153]:
# If you group the data by Location, which location has the highest average rating?
    nn

IndentationError: unexpected indent (3749100734.py, line 2)

In [ ]:
# Group the data by Shop_Name. Which shop appears most frequently in the dataset?
# After grouping the data by the Type column, what's the maximum rating a 'Chain' coffee shop has received?
# If you group the data by the Location column, can you determine the range (difference between max and min) of ratings for shops in 'San Diego'?
# Group the dataset by Shop_Name. Which shop has the lowest average rating?
# By grouping the data based on Location, can you find the sum of ratings for each location?

In [154]:
# Group the data by Shop_Name. Which shop appears most frequently in the dataset?
df.groupby('Shop_Name').count().reset_index()

     Shop_Name  Location  Rating  Type
0  Blue Bottle         2       2     2
1       Dunkin         2       2     2
2   La Colombe         1       1     1
3        Peets         2       2     2
4    Starbucks         3       3     3

In [155]:
df

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
2       Dunkin  San Diego     4.1        Chain
3        Peets  Hollywood     4.3        Chain
4    Starbucks   New York     4.5        Chain
5   La Colombe   New York     4.8  Independent
6  Blue Bottle  Hollywood     4.6  Independent
7        Peets  San Diego     4.2        Chain
8    Starbucks   New York     4.4        Chain
9       Dunkin  Hollywood     3.9        Chain

In [159]:
df.groupby('Shop_Name')

In [162]:
df.groupby('Shop_Name').count()

             Location  Rating  Type
Shop_Name
Blue Bottle         2       2     2
Dunkin              2       2     2
La Colombe          1       1     1
Peets               2       2     2
Starbucks           3       3     3

In [181]:
df.groupby('Shop_Name').count()

             Location  Rating  Type
Shop_Name
Blue Bottle         2       2     2
Dunkin              2       2     2
La Colombe          1       1     1
Peets               2       2     2
Starbucks           3       3     3

In [182]:
df.groupby('Shop_Name').count().reset_index()

     Shop_Name  Location  Rating  Type
0  Blue Bottle         2       2     2
1       Dunkin         2       2     2
2   La Colombe         1       1     1
3        Peets         2       2     2
4    Starbucks         3       3     3

In [184]:
df.groupby('Shop_Name')['Rating'].count()

Shop_Name
Blue Bottle    2
Dunkin         2
La Colombe     1
Peets          2
Starbucks      3
Name: Rating, dtype: int64

In [185]:
df.groupby('Shop_Name')['Rating'].count().reset_index()

     Shop_Name  Rating
0  Blue Bottle       2
1       Dunkin       2
2   La Colombe       1
3        Peets       2
4    Starbucks       3

In [187]:
df

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
2       Dunkin  San Diego     4.1        Chain
3        Peets  Hollywood     4.3        Chain
4    Starbucks   New York     4.5        Chain
5   La Colombe   New York     4.8  Independent
6  Blue Bottle  Hollywood     4.6  Independent
7        Peets  San Diego     4.2        Chain
8    Starbucks   New York     4.4        Chain
9       Dunkin  Hollywood     3.9        Chain

In [186]:
df.groupby('Shop_Name')['Rating'].sum()

Shop_Name
Blue Bottle     9.3
Dunkin          8.0
La Colombe      4.8
Peets           8.5
Starbucks      13.4
Name: Rating, dtype: float64

In [188]:
df.groupby('Shop_Name')['Rating'].min()

Shop_Name
Blue Bottle    4.6
Dunkin         3.9
La Colombe     4.8
Peets          4.2
Starbucks      4.4
Name: Rating, dtype: float64

In [189]:
df.groupby('Shop_Name')['Rating'].max()

Shop_Name
Blue Bottle    4.7
Dunkin         4.1
La Colombe     4.8
Peets          4.3
Starbucks      4.5
Name: Rating, dtype: float64

In [190]:
df.groupby('Shop_Name')['Rating'].min()

Shop_Name
Blue Bottle    4.6
Dunkin         3.9
La Colombe     4.8
Peets          4.2
Starbucks      4.4
Name: Rating, dtype: float64

In [191]:
df.groupby('Shop_Name')['Rating'].count()

Shop_Name
Blue Bottle    2
Dunkin         2
La Colombe     1
Peets          2
Starbucks      3
Name: Rating, dtype: int64

In [ ]:
df.groupby('Shop_Name')['Rating'].count()

In [192]:
df.groupby('Shop_Name')['Rating'].mean()

Shop_Name
Blue Bottle    4.650000
Dunkin         4.000000
La Colombe     4.800000
Peets          4.250000
Starbucks      4.466667
Name: Rating, dtype: float64

In [193]:
df.groupby('Shop_Name')['Rating'].median()

Shop_Name
Blue Bottle    4.65
Dunkin         4.00
La Colombe     4.80
Peets          4.25
Starbucks      4.50
Name: Rating, dtype: float64

In [194]:
df.groupby('Shop_Name')['Rating'].std()

Shop_Name
Blue Bottle    0.070711
Dunkin         0.141421
La Colombe          NaN
Peets          0.070711
Starbucks      0.057735
Name: Rating, dtype: float64

In [195]:
df.groupby('Shop_Name')['Rating'].var()

Shop_Name
Blue Bottle    0.005000
Dunkin         0.020000
La Colombe          NaN
Peets          0.005000
Starbucks      0.003333
Name: Rating, dtype: float64

In [204]:
df.groupby('Shop_Name')['Rating']

In [200]:
df['Location'].value_counts()

Hollywood    4
San Diego    3
New York     3
Name: Location, dtype: int64

In [203]:
df['Location'].value_counts().idxmax()

'Hollywood'

In [205]:
df.groupby('Shop_Name').agg({'Rating': 'mean', 'Location': 'count'}).reset_index()

     Shop_Name    Rating  Location
0  Blue Bottle  4.650000         2
1       Dunkin  4.000000         2
2   La Colombe  4.800000         1
3        Peets  4.250000         2
4    Starbucks  4.466667         3

In [ ]:
df.groupby('Shop_Name').agg({'Rating': 'mean', 'Location': 'count'}).reset_index()

In [207]:
df.groupby('Shop_Name').mean('Rating')

               Rating
Shop_Name
Blue Bottle  4.650000
Dunkin       4.000000
La Colombe   4.800000
Peets        4.250000
Starbucks    4.466667

In [209]:
df.groupby('Shop_Name').agg({"Rating": 'mean', "Location": 'count'}).reset_index()

     Shop_Name    Rating  Location
0  Blue Bottle  4.650000         2
1       Dunkin  4.000000         2
2   La Colombe  4.800000         1
3        Peets  4.250000         2
4    Starbucks  4.466667         3